# StairsRunExtendBelowRiserBase Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunExtendBelowRiserBase Property
ParameterTypeId Class See Also
---
"Extend Below Riser Base": Extend Below Base
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunExtendBelowRiserBase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunExtendBelowRiserBase As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunExtendBelowRiserBase {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace